# APIObject Properties

---
The APIObject type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.
Top
#### Reference
APIObject Class
Autodesk.Revit.DB Namespace